--创建数据库
set names utf8;
drop database if exists data;
create database data charset=utf8;
use data;
-- 管理员
CREATE TABLE adminuser(
    uid INT PRIMARY KEY AUTO_INCREMENT,
    user VARCHAR(100),
    upwd VARCHAR(100)
);
-- 用户 信息
CREATE TABLE userinfo(
    qid INT PRIMARY KEY AUTO_INCREMENT,
    uname VARCHAR(128),#名称
    phone VARCHAR(128),#手机
    idnumber VARCHAR(150),#身份证
    addressite VARCHAR(300),#地址
    cname VARCHAR(200),#名称
    riqi VARCHAR(128)#日期
);
-- 管理员账号密码
INSERT INTO adminuser values
(null,'管理员','zheng123');
-- 用户信息    测试数据
INSERT INTO userinfo values
(null,'张三','17603879169','412725200012204126','郑州市金水区文化路106号楼','王者荣耀研发团队','2019-10-12'),
(null,'张三','17603879169','412725200012204126','郑州市金水区文化路106号楼','王者荣耀研发团队','2019-10-13'),
(null,'张三','17603879169','412725200012204126','郑州市金水区文化路106号楼','王者荣耀研发团队','2019-10-14'),
(null,'张三','17603879169','412725200012204126','郑州市金水区文化路106号楼','王者荣耀研发团队','2019-10-15'),
(null,'张三','17603879169','412725200012204126','郑州市金水区文化路106号楼','王者荣耀研发团队','2019-10-16'),
(null,'张三','17603879169','412725200012204126','郑州市金水区文化路106号楼','王者荣耀研发团队','2019-10-17'),
(null,'张三','17603879169','412725200012204126','郑州市金水区文化路106号楼','王者荣耀研发团队','2019-10-18'),
(null,'张三','17603879169','412725200012204126','郑州市金水区文化路106号楼','王者荣耀研发团队','2019-10-19'),
(null,'张三','17603879169','412725200012204126','郑州市金水区文化路106号楼','王者荣耀研发团队','2019-10-20'),
(null,'张三','17603879169','412725200012204126','郑州市金水区文化路106号楼','王者荣耀研发团队','2019-10-21');
